# TemperatureLoadOnLine

Temperature load on line

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.temperature_load_on_line import TemperatureLoadOnLine

# TODO update the JSON string below
json = "{}"
# create an instance of TemperatureLoadOnLine from a JSON string
temperature_load_on_line_instance = TemperatureLoadOnLine.from_json(json)
# print the JSON string representation of the object
print(TemperatureLoadOnLine.to_json())

# convert the object into a dict
temperature_load_on_line_dict = temperature_load_on_line_instance.to_dict()
# create an instance of TemperatureLoadOnLine from a dict
temperature_load_on_line_from_dict = TemperatureLoadOnLine.from_dict(temperature_load_on_line_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)